from task4_ans import Cat  # ваши классы
from task4_ans import Dog  # ваши классы

# напишите 3 класса: Animal, Cat, Dog. Псоление два должны наледоваться от класса Animal
# в классах Cat и Dog должна быть ТОЛЬКО одна функция: sound, которая выводит имя животого и его звук
# класс Animal должен "запоминать" имя питомца и иметь фуункцию sound,
# которая должна выводить как животное готовится что-то сказать

cat = Cat("мурка")
cat.sound()
# кх-кх
# МЯУ! Я мурка

dog = Dog("Пёсиль")
dog.sound()
# кх-кх
# ГАВ! Я Пёсиль

